
//Создайте массив из 15 случайных целых чисел из отрезка [0;9]. 
//Выведите массив на экран. 
//Подсчитайте сколько в массиве чётных элементов 
//и выведете это количество на экран на отдельной строке.
package arrays;

import java.util.Random;

public class AnArrayRandomNumbers {

	public static void main(String[] args) {
		int[] array = new int[15];//Оголошуємо масив на 15 елементів
		int b = 0;// створюємо змінну для яка буде нам рахувати кількість парних чисел
		for (int i = 0; i < array.length; i++) {// створюємо бігунця який присвоїть кожному елементу масиву якесь випадкове значення
			Random random = new Random();// ініціалізуємо наш рандом
			array[i] = random.nextInt(10);// кожному елементу масиву присвоюємо випадкове значення від нуля до 10-ти
			System.out.print(array[i] +" ");// виводимо наш масив в консоль
  if(array[i]>0&array[i]%2==0)b++;// якщо елемент масиву >0 та залишо ділення по модулю елемента масиву на 2 рівний 0 то кількість парних чисел збільшити на 1
        }
        System.out.println(" ");
        System.out.println("Всего в массиве "+b+" четных");
	}
			
		

	}


